tap "homebrew/bundle"
tap "homebrew/services"

# Bootstrap / dotfiles
brew "chezmoi"

# Core CLI
brew "git"
brew "gh"
brew "curl"
brew "wget"
brew "jq"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "tree"
brew "bat"
brew "eza"
brew "zoxide"
brew "tmux"

# Shell
brew "starship"
brew "antidote"

# Dev tooling
brew "uv"
brew "mise"
brew "pnpm"
brew "yt-dlp"

# Mac automation helpers
brew "mas"
brew "dockutil"

# Browsers
cask "google-chrome"
cask "arc"
cask "helium-browser"

# Editors
cask "visual-studio-code"
cask "cursor"

# Terminals
cask "ghostty"
cask "iterm2"

# Productivity
cask "raycast"
cask "notion"
cask "obsidian"
cask "slack"
cask "zoom"
cask "figma"
cask "1password"
cask "1password-cli"

# Window / input helpers
cask "alt-tab"
cask "mos"

# Containers
cask "orbstack"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-mononoki-nerd-font"

# Manual / future:
# - Magnet is a Mac App Store app. Install manually for now.
# - App Store automation can be added later with `mas "App", id: 123`.
# - Docker Desktop is intentionally omitted; OrbStack is the container app.
# - Rectangle is intentionally omitted; Magnet is the intended window manager.
